# 1.Найдите сумму цифр трехзначного числа.
# Пример:
# No 123 -> 6 (1 + 2 + 3)
# No 100 -> 1 (1 + 0 + 0)

abc = input('ввидите трехзначное число: ')
abc = int(abc)
sum1 = abc % 10
abc = abc // 10
sum2 = abc % 10
abc = abc // 10

print('Сумма числа:', abc + sum1 + sum2)